Masmiseim36/nxpSDK/devices/MKV10Z7/cmsis_drivers/fsl_dspi_cmsis.c
    switch (control & ARM_SPI_CONTROL_Msk)
    {
        case ARM_SPI_MODE_INACTIVE:
            DSPI_Enable(dspi->resource->base, false);
            result = ARM_DRIVER_OK;
            break;

        case ARM_SPI_MODE_MASTER: /* SPI Master (Output on SOUT, Input on SIN); arg = Bus Speed in bps */
            DSPI_SetMasterSlaveMode(dspi->resource->base, kDSPI_Master);
            DSPI_MasterTransferCreateHandle(dspi->resource->base, &dspi->handle->masterHandle,
                                            KSDK_DSPI_MasterInterruptCallback, (void *)dspi->event);
            dspi->baudRate_Bps = arg;
            dspi->flags |= (uint8_t)SPI_FLAG_CONFIGURED;
            isContinue = true;
            break;

        case ARM_SPI_MODE_SLAVE: /* SPI Slave  (Output on SOUT, Input on SIN) */
            DSPI_SetMasterSlaveMode(dspi->resource->base, kDSPI_Slave);
            DSPI_SlaveTransferCreateHandle(dspi->resource->base, &dspi->handle->slaveHandle,
                                           KSDK_DSPI_SlaveInterruptCallback, (void *)dspi->event);

            dspi->flags |= (uint8_t)SPI_FLAG_CONFIGURED;
            isContinue = true;
            break;

        case ARM_SPI_GET_BUS_SPEED: /* Get Bus Speed in bps */
            if (!DSPI_IsMaster(dspi->resource->base))
            {
                result = ARM_DRIVER_ERROR_UNSUPPORTED;
                break;
            }

            result = (int32_t)dspi->baudRate_Bps;
            break;

        case ARM_SPI_SET_BUS_SPEED: /* Set Bus Speed in bps; */
            if (!DSPI_IsMaster(dspi->resource->base))
            {
                result = ARM_DRIVER_ERROR_UNSUPPORTED;
                break;
            }
            if (0U == DSPI_MasterSetBaudRate(dspi->resource->base, kDSPI_Ctar0, arg, dspi->resource->GetFreq()))
            {
                result = ARM_DRIVER_ERROR;
                break;
            }

            dspi->baudRate_Bps = arg;
            break;

        case ARM_SPI_CONTROL_SS: /* Control Slave Select; arg = 0:inactive, 1:active  */
            result = ARM_DRIVER_ERROR_UNSUPPORTED;
            break;

        case ARM_SPI_ABORT_TRANSFER: /* Abort current data transfer */
            if (DSPI_IsMaster(dspi->resource->base))
            {
                DSPI_MasterTransferAbort(dspi->resource->base, &dspi->handle->masterHandle);
            }
            else
            {
                DSPI_SlaveTransferAbort(dspi->resource->base, &dspi->handle->slaveHandle);
            }
            result = ARM_DRIVER_OK;
            break;

        case ARM_SPI_SET_DEFAULT_TX_VALUE: /* Set default Transmit value; arg = value */
            DSPI_SetDummyData(dspi->resource->base, (uint8_t)arg);
            result = ARM_DRIVER_OK;
            break;

        case ARM_SPI_MODE_MASTER_SIMPLEX: /* SPI Master (Output/Input on MOSI); arg = Bus Speed in bps */
            /* Mode is not supported by current driver. */
            result = ARM_DRIVER_ERROR_UNSUPPORTED;
            break;

        case ARM_SPI_MODE_SLAVE_SIMPLEX: /* SPI Slave  (Output/Input on MISO) */
            /* Mode is not supported by current driver. */
            result = ARM_DRIVER_ERROR_UNSUPPORTED;
            break;

        default:
            isContinue = true;
            break;
    }

    if (isContinue)
    {
        result = DSPI_CommonControl(control, dspi->baudRate_Bps, dspi->resource, &dspi->flags);
    }
    return result;
}

static ARM_SPI_STATUS DSPI_InterruptGetStatus(cmsis_dspi_interrupt_driver_state_t *dspi)
{
    ARM_SPI_STATUS stat;
    uint32_t ksdk_dspi_status = DSPI_GetStatusFlags(dspi->resource->base);

    if (DSPI_IsMaster(dspi->resource->base))
    {
        stat.busy = ((dspi->handle->masterHandle.remainingSendByteCount > 0U) ||
                     (dspi->handle->masterHandle.remainingReceiveByteCount > 0U)) ?
                        (1U) :
                        (0U);
    }
    else
    {
        stat.busy = ((dspi->handle->slaveHandle.remainingSendByteCount > 0U) ||
                     (dspi->handle->slaveHandle.remainingReceiveByteCount > 0U)) ?
                        (1U) :
                        (0U);
    }
    stat.data_lost = (((ksdk_dspi_status & (uint32_t)kDSPI_TxFifoUnderflowFlag) != 0U) ||
                      ((ksdk_dspi_status & (uint32_t)kDSPI_RxFifoOverflowFlag) != 0U)) ?
                         (1U) :
                         (0U);
    stat.mode_fault = 0U;
    stat.reserved   = 0U;

    return stat;
}

#endif

#if defined(DSPI0) && defined(RTE_SPI0) && RTE_SPI0

/* User needs to provide the implementation for DSPI0_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t DSPI0_GetFreq(void);

static cmsis_dspi_resource_t DSPI0_Resource = {DSPI0, 0, DSPI0_GetFreq};

#if defined(RTE_SPI0_DMA_EN) && RTE_SPI0_DMA_EN

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
static cmsis_dspi_edma_resource_t DSPI0_EdmaResource = {
    RTE_SPI0_DMA_TX_DMA_BASE,   RTE_SPI0_DMA_TX_CH,  RTE_SPI0_DMA_TX_DMAMUX_BASE, RTE_SPI0_DMA_TX_PERI_SEL,
    RTE_SPI0_DMA_RX_DMA_BASE,   RTE_SPI0_DMA_RX_CH,  RTE_SPI0_DMA_RX_DMAMUX_BASE, RTE_SPI0_DMA_RX_PERI_SEL,
    RTE_SPI0_DMA_LINK_DMA_BASE, RTE_SPI0_DMA_LINK_CH};
static cmsis_dspi_edma_handle_t DSPI0_EdmaHandle;

static edma_handle_t DSPI0_EdmaRxRegToRxDataHandle;
static edma_handle_t DSPI0_EedmaTxDataToIntermediaryHandle;
static edma_handle_t DSPI0_EedmaIntermediaryToTxRegHandle;
static edma_handle_t DSPI0_EedmaTxDataToTxRegHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("dspi0_edma_driver_state")
static cmsis_dspi_edma_driver_state_t DSPI0_EdmaDriverState = {
#else
static cmsis_dspi_edma_driver_state_t DSPI0_EdmaDriverState = {
#endif
    &DSPI0_Resource,
    &DSPI0_EdmaResource,
    &DSPI0_EdmaHandle,
    &DSPI0_EdmaRxRegToRxDataHandle,
    &DSPI0_EedmaTxDataToIntermediaryHandle,
    &DSPI0_EedmaIntermediaryToTxRegHandle,
    &DSPI0_EedmaTxDataToTxRegHandle,
};

static int32_t DSPI0_EdmaInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI0_PIN_INIT
    RTE_SPI0_PIN_INIT();
#endif
    return DSPI_EdmaInitialize(cb_event, &DSPI0_EdmaDriverState);
}

static int32_t DSPI0_EdmaUninitialize(void)
{
#ifdef RTE_SPI0_PIN_DEINIT
    RTE_SPI0_PIN_DEINIT();
#endif
    return DSPI_EdmaUninitialize(&DSPI0_EdmaDriverState);
}

