Masmiseim36/nxpSDK/devices/MKV10Z7/cmsis_drivers/fsl_dspi_cmsis.c
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("dspi1_interrupt_driver_state")
static cmsis_dspi_interrupt_driver_state_t DSPI1_InterruptDriverState = {
#else
static cmsis_dspi_interrupt_driver_state_t DSPI1_InterruptDriverState = {
#endif
    &DSPI1_Resource,
    &DSPI1_Handle,
};

static int32_t DSPI1_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI1_PIN_INIT
    RTE_SPI1_PIN_INIT();
#endif
    return DSPI_InterruptInitialize(cb_event, &DSPI1_InterruptDriverState);
}

static int32_t DSPI1_InterruptUninitialize(void)
{
#ifdef RTE_SPI1_PIN_DEINIT
    RTE_SPI1_PIN_DEINIT();
#endif
    return DSPI_InterruptUninitialize(&DSPI1_InterruptDriverState);
}

static int32_t DSPI1_InterruptPowerControl(ARM_POWER_STATE state)
{
    return DSPI_InterruptPowerControl(state, &DSPI1_InterruptDriverState);
}

static int32_t DSPI1_InterruptSend(const void *data, uint32_t num)
{
    return DSPI_InterruptSend(data, num, &DSPI1_InterruptDriverState);
}

static int32_t DSPI1_InterruptReceive(void *data, uint32_t num)
{
    return DSPI_InterruptReceive(data, num, &DSPI1_InterruptDriverState);
}

static int32_t DSPI1_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return DSPI_InterruptTransfer(data_out, data_in, num, &DSPI1_InterruptDriverState);
}

static uint32_t DSPI1_InterruptGetCount(void)
{
    return DSPI_InterruptGetCount(&DSPI1_InterruptDriverState);
}

static int32_t DSPI1_InterruptControl(uint32_t control, uint32_t arg)
{
    return DSPI_InterruptControl(control, arg, &DSPI1_InterruptDriverState);
}

static ARM_SPI_STATUS DSPI1_InterruptGetStatus(void)
{
    return DSPI_InterruptGetStatus(&DSPI1_InterruptDriverState);
}

#endif

ARM_DRIVER_SPI Driver_SPI1 = {DSPIx_GetVersion,     DSPIx_GetCapabilities,
#if defined(RTE_SPI1_DMA_EN) && RTE_SPI1_DMA_EN
                              DSPI1_EdmaInitialize, DSPI1_EdmaUninitialize, DSPI1_EdmaPowerControl, DSPI1_EdmaSend,
                              DSPI1_EdmaReceive,    DSPI1_EdmaTransfer,     DSPI1_EdmaGetCount,     DSPI1_EdmaControl,
                              DSPI1_EdmaGetStatus
#else
                              DSPI1_InterruptInitialize,
                              DSPI1_InterruptUninitialize,
                              DSPI1_InterruptPowerControl,
                              DSPI1_InterruptSend,
                              DSPI1_InterruptReceive,
                              DSPI1_InterruptTransfer,
                              DSPI1_InterruptGetCount,
                              DSPI1_InterruptControl,
                              DSPI1_InterruptGetStatus
#endif
};

#endif /*  DSPI1  */

#if defined(DSPI2) && defined(RTE_SPI2) && RTE_SPI2

/* User needs to provide the implementation for DSPI2_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t DSPI2_GetFreq(void);

static cmsis_dspi_resource_t DSPI2_Resource = {DSPI2, 2, DSPI2_GetFreq};

#if defined(RTE_SPI2_DMA_EN) && RTE_SPI2_DMA_EN

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
static cmsis_dspi_edma_resource_t DSPI2_EdmaResource = {
    RTE_SPI2_DMA_TX_DMA_BASE,   RTE_SPI2_DMA_TX_CH,  RTE_SPI2_DMA_TX_DMAMUX_BASE, RTE_SPI2_DMA_TX_PERI_SEL,

    RTE_SPI2_DMA_RX_DMA_BASE,   RTE_SPI2_DMA_RX_CH,  RTE_SPI2_DMA_RX_DMAMUX_BASE, RTE_SPI2_DMA_RX_PERI_SEL,

    RTE_SPI2_DMA_LINK_DMA_BASE, RTE_SPI2_DMA_LINK_CH};

static cmsis_dspi_edma_handle_t DSPI2_EdmaHandle;

static edma_handle_t DSPI2_EdmaRxRegToRxDataHandle;
static edma_handle_t DSPI2_EedmaTxDataToIntermediaryHandle;
static edma_handle_t DSPI2_EedmaIntermediaryToTxRegHandle;
static edma_handle_t DSPI2_EedmaTxDataToTxRegHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("dspi2_edma_driver_state")
static cmsis_dspi_edma_driver_state_t DSPI2_EdmaDriverState = {
#else
static cmsis_dspi_edma_driver_state_t DSPI2_EdmaDriverState = {
#endif
    &DSPI2_Resource,
    &DSPI2_EdmaResource,
    &DSPI2_EdmaHandle,
    &DSPI2_EdmaRxRegToRxDataHandle,
    &DSPI2_EedmaTxDataToIntermediaryHandle,
    &DSPI2_EedmaIntermediaryToTxRegHandle,
    &DSPI2_EedmaTxDataToTxRegHandle,
};

static int32_t DSPI2_EdmaInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI2_PIN_INIT
    RTE_SPI2_PIN_INIT();
#endif
    return DSPI_EdmaInitialize(cb_event, &DSPI2_EdmaDriverState);
}

static int32_t DSPI2_EdmaUninitialize(void)
{
#ifdef RTE_SPI2_PIN_DEINIT
    RTE_SPI2_PIN_DEINIT();
#endif
    return DSPI_EdmaUninitialize(&DSPI2_EdmaDriverState);
}

static int32_t DSPI2_EdmaPowerControl(ARM_POWER_STATE state)
{
    return DSPI_EdmaPowerControl(state, &DSPI2_EdmaDriverState);
}

static int32_t DSPI2_EdmaSend(const void *data, uint32_t num)
{
    return DSPI_EdmaSend(data, num, &DSPI2_EdmaDriverState);
}

static int32_t DSPI2_EdmaReceive(void *data, uint32_t num)
{
    return DSPI_EdmaReceive(data, num, &DSPI2_EdmaDriverState);
}

static int32_t DSPI2_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return DSPI_EdmaTransfer(data_out, data_in, num, &DSPI2_EdmaDriverState);
}

static uint32_t DSPI2_EdmaGetCount(void)
{
    return DSPI_EdmaGetCount(&DSPI2_EdmaDriverState);
}

static int32_t DSPI2_EdmaControl(uint32_t control, uint32_t arg)
{
    return DSPI_EdmaControl(control, arg, &DSPI2_EdmaDriverState);
}

static ARM_SPI_STATUS DSPI2_EdmaGetStatus(void)
{
    return DSPI_EdmaGetStatus(&DSPI2_EdmaDriverState);
}

#endif

#else

static cmsis_dspi_handle_t DSPI2_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("dspi2_interrupt_driver_state")
static cmsis_dspi_interrupt_driver_state_t DSPI2_InterruptDriverState = {
#else
static cmsis_dspi_interrupt_driver_state_t DSPI2_InterruptDriverState = {
#endif
    &DSPI2_Resource,
    &DSPI2_Handle,
};

static int32_t DSPI2_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI2_PIN_INIT
    RTE_SPI2_PIN_INIT();
#endif
    return DSPI_InterruptInitialize(cb_event, &DSPI2_InterruptDriverState);
}

static int32_t DSPI2_InterruptUninitialize(void)
{
#ifdef RTE_SPI2_PIN_DEINIT
    RTE_SPI2_PIN_DEINIT();
#endif
    return DSPI_InterruptUninitialize(&DSPI2_InterruptDriverState);
}

static int32_t DSPI2_InterruptPowerControl(ARM_POWER_STATE state)
{
    return DSPI_InterruptPowerControl(state, &DSPI2_InterruptDriverState);
}

static int32_t DSPI2_InterruptSend(const void *data, uint32_t num)
{
    return DSPI_InterruptSend(data, num, &DSPI2_InterruptDriverState);
}

static int32_t DSPI2_InterruptReceive(void *data, uint32_t num)
{
    return DSPI_InterruptReceive(data, num, &DSPI2_InterruptDriverState);
}

static int32_t DSPI2_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return DSPI_InterruptTransfer(data_out, data_in, num, &DSPI2_InterruptDriverState);
}

static uint32_t DSPI2_InterruptGetCount(void)
{
    return DSPI_InterruptGetCount(&DSPI2_InterruptDriverState);
}

static int32_t DSPI2_InterruptControl(uint32_t control, uint32_t arg)
{
    return DSPI_InterruptControl(control, arg, &DSPI2_InterruptDriverState);
}

static ARM_SPI_STATUS DSPI2_InterruptGetStatus(void)
{
    return DSPI_InterruptGetStatus(&DSPI2_InterruptDriverState);
}
#endif

ARM_DRIVER_SPI Driver_SPI2 = {DSPIx_GetVersion,     DSPIx_GetCapabilities,
#if defined(RTE_SPI2_DMA_EN) && RTE_SPI2_DMA_EN
                              DSPI2_EdmaInitialize, DSPI2_EdmaUninitialize, DSPI2_EdmaPowerControl, DSPI2_EdmaSend,
                              DSPI2_EdmaReceive,    DSPI2_EdmaTransfer,     DSPI2_EdmaGetCount,     DSPI2_EdmaControl,
                              DSPI2_EdmaGetStatus
#else
                              DSPI2_InterruptInitialize,
                              DSPI2_InterruptUninitialize,
                              DSPI2_InterruptPowerControl,
                              DSPI2_InterruptSend,
                              DSPI2_InterruptReceive,
                              DSPI2_InterruptTransfer,
                              DSPI2_InterruptGetCount,
                              DSPI2_InterruptControl,
                              DSPI2_InterruptGetStatus
#endif
};

#endif /*  DSPI2  */
